/*****************************************************************
                           RELAY.C  file

主要功能：负责继电器模块的控制及初始化

创建时间：2015.10.31
*****************************************************************/
/*--------------------------------------------------------------*/
/*---------------------------头文件-----------------------------*/
/*--------------------------------------------------------------*/
#include <STC89C5xRC.h>
#include "intrins.h"
#include "RELAY.h"
#include "DELAY.h"
#include "CONFIG.h"

/*--------------------------------------------------------------*/



/*--------------------------------------------------------------*/
/*-------------------------全局变量定义-------------------------*/
/*--------------------------------------------------------------*/
bit Relay_Check_Flag;									//继电器状态检测标志位
bit Relay_On_Flag;
bit Relay_Off_Flag;
bit Relay1_Act_Flag,Relay2_Act_Flag,Relay3_Act_Flag,Relay4_Act_Flag;									  //继电器输出状态动作标志位
bit  Relay_Flag;                                      //继电器动作标志位
unsigned char Relay_Value;                            //继电器控制值
unsigned char Relay_Value1;                           //继电器控制值备份
unsigned char Which_Relay;
/*--------------------------------------------------------------*/
/*--------------------------------------------------------------*/
/*--------------------------写HCF4094---------------------------*/
/*--------------------------------------------------------------*/
void write4094(unsigned char data1) 
{
	unsigned char i;       
	for(i=0;i<8;i++)     //写八位数据进HCF4094;
	{
		DATA=(data1<<i)&0x80;
		CLK=0;       
		delayus(30);
		CLK=1;
		delayus(30);
	}
		STR=0;     	
		delayus(20);
		STR=1;  
}
/*--------------------------------------------------------------*/
/*-------------------------继电器初始化-------------------------*/
/*--------------------------------------------------------------*/
void init_relay()
{
	Relay_Value=0x00;                                  //关闭所有继电器
	write4094(Relay_Value);
	Relay_Value=0x00;
	Relay_Value1=0x00;                                 //备份值与现有继电器控制值相同
	Relay_Flag=0;
	Relay_Check_Flag=1;                                      //无继电器动作
	Which_Relay=0;
}
/*--------------------------------------------------------------*/

/*--------------------------------------------------------------*/
/*------------------------继电器处理程序------------------------*/
/*--------------------------------------------------------------*/
void relay_handle()
{
	write4094(Relay_Value);
	if((Relay_Value&0x01)!=(Relay_Value1&0x01))
		Relay1_Act_Flag=1;									//继电器动作标志位
	else if((Relay_Value&0x02)!=(Relay_Value1&0x02))
		Relay2_Act_Flag=1;
	else if((Relay_Value&0x04)!=(Relay_Value1&0x04))
		Relay3_Act_Flag=1;
	else if((Relay_Value&0x08)!=(Relay_Value1&0x08))
		Relay4_Act_Flag=1;	
	Relay_Flag=1;                                      //继电器反馈报文标志位置1--->>主函数
}