/*****************************************************************
                             SENSOR.C  file

主要功能：负责定义温湿度传感控制函数以及相应变量

创建时间：2015.10.31
*****************************************************************/
#include "SENSOR_T_H.h"
#include <STC89C5xRC.h>
#include <intrins.h>


bit      Sensor_T_H_Flag;                                        //温湿度传感器启动标志位
bit      Sensor_T_H_Flag1;                                       //温湿度传感器读取标志位
bit      T_Or_H;                                                 //0为温度测量，1为湿度测量


float Temperature;                                               //温度测量值，-40--123.8(摄氏度)
float Humidity;                                                  //湿度测量值，0--100（%RH）
unsigned int Sensor_T_H_Counter;                                 //温湿度传感器计数器，每隔4s进行一次温度测量和一次湿度测量

/*--------------------------------------------------------------*/
/*---------------------温湿度传感器初始化----------------------*/
/*--------------------------------------------------------------*/
void init_sensor_t_h()
{
	T_H_Sck=0;
	T_H_Data=1;
	Sensor_T_H_Flag=0;
	Sensor_T_H_Flag1=0;
	T_Or_H=0;
	Sensor_T_H_Counter=0;
	Temperature=0;
	Humidity=0;
}

/*--------------------------------------------------------------*/
/*----------------------启动温湿度传感器-----------------------*/
/*--------------------------------------------------------------*/
void star_sensor_t_h()
{
	if(T_Or_H)                                               //启动湿度测量
	{
    /*------------------------启动传输信号---------------------*/
		T_H_Sck=1;
		_nop_();
		T_H_Data=0;
		_nop_();
		T_H_Sck=0;
		_nop_();
		_nop_();
		T_H_Sck=1;
		_nop_();
		T_H_Data=1;
		_nop_();
		T_H_Sck=0;
		_nop_();
		/*-----------------------写地址（000）---------------------*/
		T_H_Data=0;
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		_nop_();
		/*----------写命令（00101，启动湿度测量命令）-------------*/
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		T_H_Data=1;
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		T_H_Data=0;
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		T_H_Data=1;
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		/*------------------------读取应答信号---------------------*/
		T_H_Sck=0;
		_nop_();
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
	}
	
	else                                                     //启动温度测量
	{
		 /*------------------------启动传输信号---------------------*/
		T_H_Sck=1;
		_nop_();
		T_H_Data=0;
		_nop_();
		T_H_Sck=0;
		_nop_();
		_nop_();
		T_H_Sck=1;
		_nop_();
		T_H_Data=1;
		_nop_();
		T_H_Sck=0;
		_nop_();
		/*-----------------------写地址（000）---------------------*/
		T_H_Data=0;
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		_nop_();
		/*----------写命令（00011，启动温度测量命令）-------------*/
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		T_H_Data=0;
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		T_H_Data=1;
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		T_H_Data=1;
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		/*------------------------读取应答信号---------------------*/
		T_H_Sck=0;
		_nop_();
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
	}
	
	Sensor_T_H_Flag=0;
	Sensor_T_H_Flag1=1;
}

/*--------------------------------------------------------------*/
/*----------------------读取温湿度传感器-----------------------*/
/*--------------------------------------------------------------*/
void read_sensor_t_h()
{
	unsigned int T_H_Temp=0;                                 //临时变量，用于存放从SH10中读取的温度值或者湿度值（AD转换后），需要转换后才能得到真正的温度和湿度
	unsigned char i;
	if(T_Or_H)                                               //读取湿度测量值
	{
		/*-----------------------读取无效位(0000)-------------------*/
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		_nop_();
		/*--------------------------读取高4位-----------------------*/
		for(i=0;i<4;i++)
		{
			T_H_Sck=1;
			T_H_Temp=T_H_Temp<<1;
			T_H_Temp=T_H_Temp|T_H_Data;
			T_H_Sck=0;
			_nop_();
			_nop_();
		}
		/*-----------------------发送应答信号-----------------------*/
		T_H_Data=0;
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		_nop_();
	  /*--------------------------读取低8位-----------------------*/
		for(i=0;i<8;i++)
		{
			T_H_Sck=1;
			T_H_Temp=T_H_Temp<<1;
			T_H_Temp=T_H_Temp|T_H_Data;
			T_H_Sck=0;
			_nop_();
			_nop_();
		}
		/*-------------发送非应答信号，跳过CRC效验-----------------*/
		T_H_Data=1;                                        //非应答信号
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		_nop_();
		/*---------------------------湿度转换-----------------------*/
		Humidity=0.0367*T_H_Temp-1.5955e-6*T_H_Temp*T_H_Temp-2.0468;
	}
	
	else                                                     //读取温度测量值
	{
		/*------------------------读取无效位(00)--------------------*/
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		_nop_();
		/*--------------------------读取高6位-----------------------*/
		for(i=0;i<6;i++)
		{
			T_H_Sck=1;
			T_H_Temp=T_H_Temp<<1;
			T_H_Temp=T_H_Temp|T_H_Data;
			T_H_Sck=0;
			_nop_();
			_nop_();
		}
		/*-----------------------发送应答信号-----------------------*/
		T_H_Data=0;
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		_nop_();
	  /*--------------------------读取低8位-----------------------*/
		for(i=0;i<8;i++)
		{
			T_H_Sck=1;
			T_H_Temp=T_H_Temp<<1;
			T_H_Temp=T_H_Temp|T_H_Data;
			T_H_Sck=0;
			_nop_();
			_nop_();
		}
		/*-------------发送非应答信号，跳过CRC效验-----------------*/
		T_H_Data=1;                                        //非应答信号
		_nop_();
		T_H_Sck=1;
		_nop_();
		_nop_();
		T_H_Sck=0;
		_nop_();
		_nop_();
		/*---------------------------温度转换-----------------------*/
		Temperature=0.01*T_H_Temp-40.1;
	}
	
	Sensor_T_H_Flag1=0;
	T_Or_H=~T_Or_H;                                         //温度测量和湿度测量轮流进行
}